In [18]:
from hossam import load_data
from pandas import DataFrame

In [19]:
origin = load_data('vip_customer')
origin

[data] https://data.hossam.kr/data/lab04/vip_customer.xlsx
[desc] VIP 고객 목록 데이터

field             description
----------------  ----------------
CustomerID        고객번호
Name              고객명
Age               나이
City              거주지역
JoinDate          가입일
TotalSpending     총 지출액
LastPurchaseDate  마지막 구매 날짜

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1002        이영희   28   부산 2021-03-22          80000       2023-10-15
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1004        최지우   25   인천 2023-02-20          50000       2023-09-25
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1006        윤현우   38   부산 2022-05-30         120000       2023-11-05
1007        강예진   29   서울 2023-01-15          85000       2023-10-22
1008        오승민   45   광주 2021-08-12         180000       2023-11-08
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1010        송서연   33   대전 2023-04-01          65000       2023-09-30
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1012        장유나   26   부산 2023-03-10          40000       2023-08-15
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1014        신은경   30   대구 2021-12-20          95000       2023-10-18
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [20]:
r2 = origin.query('City == "서울"')
r2

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1007        강예진   29   서울 2023-01-15          85000       2023-10-22
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [21]:
r3 = origin.query('TotalSpending >100000')
r3

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1006        윤현우   38   부산 2022-05-30         120000       2023-11-05
1008        오승민   45   광주 2021-08-12         180000       2023-11-08
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [ ]:
r4 = origin.query('City == "서울"and TotalSpending >100000' ) #우수 고객은 총 구매액이 100,000원 이상인 고객, 활동적인 고객은 서울시에 거주하는 고객
r4

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [34]:
r5 = r4.sort_values('TotalSpending', ascending=False)
r5

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [38]:
fl = r5.filter(['Name', 'City','TotalSpending'])
fl

           Name City  TotalSpending
CustomerID
1009        한지민   서울         450000
1005        정다솜   서울         320000
1003        박민준   서울         250000
1011        임도윤   서울         210000
1013        황재민   서울         190000
1001        김철수   서울         150000
1015        고은별   서울         130000

In [40]:
fl.head()

           Name City  TotalSpending
CustomerID
1009        한지민   서울         450000
1005        정다솜   서울         320000
1003        박민준   서울         250000
1011        임도윤   서울         210000
1013        황재민   서울         190000